Repository: dinhquydds/nanocucurmin
Catalog: tm/detai-level2.tmx
Source language: en_us
Languages: vi

source: If your swelling was caused by an injury, sting, or disease, you might experience a wide range of symptoms.
vi: Nếu sưng do chấn thương, côn trùng đốt, hoặc bệnh, bạn có thể gặp một loạt triệu chứng.

source: Imaging tests might reveal blockages in your arteries and veins, inflamed muscle or tissue, or bone fractures.
vi: Kiểm tra hình ảnh có thể tiết lộ tắc nghẽn trong động mạch và tĩnh mạch, viêm cơ hoặc mô, hoặc gãy xương.

source: Immunohistochemistry
vi: Hoá mô miễn dịch

source: Immunohistological Evaluation of Revascularized Immature Permanent Necrotic Teeth Treated by Platelet-Rich Plasma: An Animal Investigation
vi: Đánh giá hoá mô miễn dịch của tái sinh mạch máu răng vĩnh viễn hoại tử chưa trưởng thành bằng huyết tương giàu tiểu cầu: Nghiên cứu động vật.

source: Impaired wound healing in the elderly presents a major clinical and economic problem.
vi: Việc chữa lành vết thương không hiệu quả ở người cao tuổi là vấn đề lâm sàng và kinh tế.

source: Implantology
vi: Cấy ghép

source: In addition to the traditional use of calcium hydroxide [Ca(OH)2] as a long-term intracanal medicament to induce apexification in immature permanent teeth (6), recent publications suggest the short-term application of Ca(OH)2 as an intra- canal disinfectant in endodontic regeneration (7, 8).
vi: Ngoài việc dùng calcium hydroxide là thuốc băng nội nha lâu dài để gây đóng chóp ở răng chưa trưởng thành (6), các công bố gần đây đề nghị dùng calcium hydroxide thời gian ngắn để khử trùng trong nội nha tái tạo (7, 8).

source: In addition trismus and swelling are a common postoperative sequelea which is related to local inflammatory reaction, with cycloxygenase (COX) and prostaglandins playing an important crucial role in these complications.
vi: Ngoài ra khít hàm và sưng là những biến chứng phổ biến sau phẫu thuật liên quan đến phản ứng viêm tại chỗ, với cycloxygenase (COX) và prostaglandins đóng vai trò quan trọng gây ra biến các biến chứng này.

source: In addition, a low pH allowed more agents to remain soluble and available for uptake into the cells; thus, the retained drug was able to develop more cytotoxicity (27).
vi: Ngoài ra, pH thấp cho phép nhiều tác nhân còn lại trong dung dịch và sẵn sàng xâm nhập vào tế bào; như vậy, thuốc còn lại có thể phát triển độc tính tế bào (27).

source: In addition, altered cell migration in wound-healing may be attributable not only to cellular defects but also to changes in serum factors associated with the senescence process.
vi: Ngoài ra, di tế bào di chuyển trong chữa bệnh vết thương có thể là do lỗi của tế bào mà còn do sự thay đổi các yếu tố huyết thanh liên quan đến quá trình lão hoá.

source: In addition, it must be kept in mind that all the mechanisms described in this section are based on in vitro results, and the clinical evidence is based mainly on short clinical pilot studies.
vi: Ngoài ra, cần lưu ý rằng tất cả các cơ chế được mô tả trong phần này dựa trên các kết quả in vitro và các bằng chứng lâm sàng chủ yếu dựa vào các nghiên cứu thí điểm lâm sàng ngắn.

source: In addition, only 1 study has evaluated the cytotoxicity of the material in direct contact with cells (14), and there is a lack of studies assessing the expression of proinflammatory cytokines in cells in direct contact with BD that have been carried out for MTA (7, 8, 15–17).
vi: Ngoài ra, chỉ 1 nghiên cứu đánh giá độc tính tế bào của vật liệu khi tiếp xúc trực tiếp với tế bào(14), và còn thiếu những nghiên cứu đánh giá những biểu hiện của các cytokin tiền viêm trong tế bào khi tiếp xúc trực tiếp với biodentine đã được thực hiện với MTA (7, 8, 15–17).

source: In an in vitro study the antimicrobial action of ciprofloxacin, metronidazole and polyethylene glycol and natrosol vehicles were assessed against 23 strains [14].
vi: Trong một nghiên cứu in vitro hoạt động kháng khuẩn của ciprofloxacin, metronidazole and polyethylene glycol và natrosol được đánh giá chống lại 23 chùng [14].

source: In brief, the infection is removed, creating a sterile environment that promotes tissue regeneration and revitalization (11, 12) and permitting the tooth to continue the development (6, 13).
vi: Tóm lại, loại bỏ nhiễm trùng, tạo ra môi trường vô khuẩn kích thích mô tái tạo và tái sinh (11, 12) và cho phép răng tiếp tục phát triển (6, 13).

source: In contrast, a necrotic pulp is rapidly invaded and colonized.
vi: Ngược lại, tuỷ hoại tử nhanh chóng bị vi khuẩn xâm chiếm.

source: In contrast, some species are found in both oral and fecal samples.
vi: Ngược lại, một số loài được tìm thấy trong cả mẫu miệng và phân.

source: In contrast, this result differed from that of a previous study by Ferreira et al (28), who reported that only 5.00 mg/mL metro- nidazole resulted in 74% human gingival fibroblast cell line viability.
vi: Ngược lại, kết quả này khác với một nghiên cứu trước của Ferreira (28) báo cáo chỉ 5.00 mg/mL sự sống của dòng nguyên bào sợi nướu răng người 74%.

source: In dental traumatology studies of replanted teeth, it has been found that is necessary to have apical foramen of size at least
vi: Trong nghiên cứu chấn thương của răng được cắm lại, người ta tìm thấy rằng cần phải có kích thước lỗ chóp ít nhất

source: In endodontics, systemic antibiotics are prescribed to suppress the infection in the pulp space and
vi: Trong nội nha, kháng sinh toàn thân được chỉ định để ngăn chặn nhiễm trùng trong khoang tuỷ và

source: In fact, it has been suggested that some observed probiotic effects are not just properties of a few well-studied strains but common to several species.-28 The ecological plaque hypothesis suggests that selective pressure in environmental conditions can change the balance between oral health and dis- ease.
vi: Trong thực tế, người ta đã gợi ý rằng một số tác dụng probiotic quan sát không chỉ là đặc tính của một số ít chủng học được nghiên cứu tốt mà còn phổ biến cho một số loài khác. Giả thuyết về mảng bám có tính sinh học cho thấy áp lực chọn lọc trong điều kiện môi trường có thể thay đổi sự cân bằng giữa sức khỏe răng miệng và dịch bệnh.

source: In fact, it takes 2-3 years for the root to become fully developed.
vi: Thực tế, nó mất 2-3 năm để phát triển đầy đủ

source: In histological animal studies it has been showed that ingrowth of connective tissue [48] or bone [49] had occurred.
vi: Trong nghiên cứu mô học động vật, người ta cho thấy rằng mô phát triển là mô liên kết [48] hoặc là xương [49].

source: In histopathological evaluation, tissue maturation, alignment, density, types of degeneration,
vi: Trong đánh giá mô bệnh học, sự trưởng thành mô, sự điều chỉnh, mật độ, loại thoái hoá,

source: In human development, the first regulatory institutions were natural religions.
vi: Phát triển con người đầu tiên quy định tổ chức này là tự nhiên và tôn giáo.

source: In last decade numerous case report and series with usage of cell-free approaches known as revascularization, revitalization or maturogenesis have been published.
vi: Trong thập kỷ qua nhiều báo cáo ca và hàng loạt ca sử dụng cách tiếp cận không tế bào được biết đến như tái sinh mạch máu, hồi sinh hoặc maturogenesis đã được xuất bản.

source: In most of these studies, the levels of salivary lacto
vi: Trong hầu hết các nghiên cứu, mức độ của lacto

source: In my view, one of the reasons for Man’s adaptation to bipedal gait was the geographical alteration in paleoecology.
vi: Theo quan điểm của tôi, một trong những lý do cho sự thích nghi của con người với dáng đi hai chân là thay đổi địa lý cổ sinh thái học.

source: In one study, after dentine conditioning with EDTA, a hair-like projections from the dentine-associated mineralized tissue, which appeared to be embedded into the dentine wall, has been described [63].
vi: Trong một nghiên cứu, sau khi xử lý ngà bằng EDTA, a hair-like projections from the dentine-associated mineralized tissue, which appeared to be embedded into the dentine wall, has been described [63].

source: In other in vitro study the minimal inhibitory combination for ciprofloxacin and minocycline against E. feacalis and E.faecium were found to be 5 and 20 µg respectively and metronidazole was reported to have no inhibitory effect.
vi: Trong nghiên cứu in vitro khác sự phối hợp ức chế tối thiểu để ciprofloxacin và minocycline chống lại E. feacalis và E.faecium là 5 - 20 µg tương ứng và metronidazole được báo cáo không có tác dụng ức chế.

source: In recent years, The Cariology Research Unit of the Niigata University has developed the concept of 'Lesion sterilization and tissue repair LSTR' therapy [3] which employs the use of a combination of antibacterial drugs for disinfection of oral infectious lesions, including dentinal, pulpal, and periradicular lesions.
vi: Trong những năm gần đây, The Cariology Research Unit of the Niigata University đã phát triển quan niệm điều trị tổn thương vô trùng và sữa chữa [3] mà sử dụng một sự kết hợp của thuốc kháng sinh để khử trùng tổn thương nhiễm trùng trong miệng, gồm ngà răng, tuỷ răng, và tổn thương quanh chóp.

source: In respect to commensal oral microbes, several aspects support the idea that it may be possible to find bacteria that could be useful in prevention or treat- ment of oral diseases.
vi: Đối với các vi khuẩn miệng miệng, một số khía cạnh ủng hộ cho ý tưởng rằng có thể tìm thấy vi khuẩn có thể hữu ích trong việc phòng ngừa hoặc điều trị bệnh răng miệng

source: In revascularization studies, it has been shown that even 0.8 mm [27] or 0.32 mm large apical foramen [28] did not prevent ingrowth of new tissue, migration of endogenous cells and blood vessels formation.
vi: Trong nghiên cứu tái sinh mạch máu, người ta chi ra răng thậm chí lỗ chóp rộng 0.8 mm [27] hoặc 0.32 mm [28] không ngăn chặn sự mọc của mô mới, di chuyển của tế bào nội sinh và hình thành mạch máu.

source: In several areas of medical sciences, especially in dentistry, many studies using animals are conducted.
vi: Trong một số lĩnh vực của y khoa, đặc biệt là nha trong nha khoa, nhiều nghiên cứu đang tiến hành dùng các loài động vật.

source: In situ
vi: Tại chỗ

source: In that investigation, acute ulcerative gingivitis was successfully treated by using metronidazole therapy.
vi: Trong nghiên cứu đó, viêm nướu hoại tử cấp được điều trị thành công bằng metronidazole.

source: In the current study, the LDH assays were used to evaluate the cytotoxicity of the different materials based on the LDH activity following the loss of cell membrane integrity, while the WST-1 assays were used to measure the cell proliferation based on the mitochondrial dehydrogenase activities.
vi: Trong các nghiên cứu hiện tại, LDH assays được dùng để đánh giá độc tính tế bào của các vật liệu khác nhau dựa trên hoạt động LDH sau khi màng tế bào mất tính toàn vẹn, trong khi WST-1 assays được dùng để đánh giá sự tăng sinh dựa trên mitochondrial dehydrogenase activities.

source: In the experimental groups that contained antibiotics, a reduced cell number was shown only for DPCs or APCs stimulated by 25.00 mg/mL 3Mix.
vi: Trong nhóm thử nghiệm có chứa kháng sinh, có sự giảm số lượng tế bào DPCs hoặc APCs chỉ thấy ở nhóm hỗn hợp 3 kháng sinh 25.00 mg/mL.

source: In the oral cavity, lactobacilli usually comprise fewer than 1% of the total cultivable microbiota, but no species spe- cific to the oral cavity has been found.
vi: Trong khoang miệng, khuẩn sữa thường bao gồm ít hơn 1% trong tổng số mảnh sinh vật, nhưng không có loài cụ thể đến khoang miệng đã được tìm thấy.

source: In the positive control and experimental groups, we removed the pulps and in- duced pulp necrosis, after which the chambers were sealed.
vi: Trong nhóm chứng dương và nhóm thực nghiệm, chúng tôi lấy tuỷ và làm hoại tử tuỷ, sau đó buồng tuỷ được trám lại.

source: In the presence of 0.39 mg/mL 3Mix or a single drug at the concentration of 25.00 mg/mL, the bacterial number was reduced, but bacteria were not completely eliminated.
vi: Khi có 0.39 mg/mL hỗn hợp 3 kháng sinh hoặc một loại kháng sinh tại nồng độ 25.00 mg/mL, vi khuẩn có giảm, nhưng không bị loại bỏ hoàn toàn.

source: In these cases, the application of PRP to root canal system is possible [32].
vi: Trong những trường hợp này, các ứng dụng của PRP để tủy hệ thống có thể [32].

source: In this article, the integral steps of cell-free treatment approaches such as source of stem cells, possible endogenous scaffolds, sources of growth factors and width of apical foramen in the context of sufficient disinfection of root canal system and outcome of treatment are discussed.
vi: Trong bài báo này, không thể tách rời bước tiếp cận điều trị không tế bào như nguồn của tế bào gốc, có thể giá thể nội sinh, nguồn của các yếu tố tăng trưởng và chiều rộng của lỗ chóp trong bối cảnh của khử trùng đầy đủ của hệ thống ống tuỷ và kết quả của điều trị được thảo luận.

source: In this process the brain creates a virtual individual reality.
vi: Trong quá trình này não tạo ra một ảo cá nhân thực tế.

source: In this regard, various medicaments like antibiotics and antiseptics have been discussed.(6)Though each has their own advantages and disadvantages, the selection of antibacterial drugs should be update so as to provide the best of sterilization of root canal systems.
vi: Trong vấn đề này, nhiều loại thuốc băng như kháng sinh và thuốc sát trùng được thảo luận. (6)mặc dù mỗi cái có ưu và nhược điểm, sự chọn lựa thuốc kháng sinh nên được cập nhật để cung cấp sự khử trùng tốt nhất cho hệ thống ống tuỷ.

source: In this report, we show that, compared to dermal fibroblasts, human gingival fibroblasts show reduced expression of pro-adhesive mRNAs and proteins including integrins a2 and a4 and focal adhesion kinase (FAK).
vi: Trong báo cáo này, chúng tôi cho rằng, so sánh với nguyên bào sợi của da, nguyên bào sợi nướu của người biểu hiện giảm của pro-adhesive mRNAs và proteins gồm integrins a2 and a4 và focal adhesion kinase (FAK).

source: In this situation, complete elimination of bacteria should be ensured for a successful outcome of endodontic treatment.
vi: Trong tình huống này, loại bỏ hoàn toàn vi khuẩn cần được đảm bảo để điều trị nội nha thành công.

source: In this study, both the LDH and WST assays showed that the highest non- toxic concentration of Ca(OH)2 for DPCs in culture was 2.5 mg ml1.
vi: Trong nghiên cứu này, cả LDH and WST assays cho thấy các nồng độ cao nhất không độc tính của Ca(OH)2 for DPCs in culture was 2.5 mg ml1.

source: In this study, only bacteria isolated from necrotic mature teeth were applied using a protocol adapted from Sassone et al (23).
vi: Trong nghiên cứu này, chỉ cô lập vi khuẩn từ răng chưa trưởng thành hoại tử được áp dụng dùng quy trình phù hợp của Sassone (23).

source: In vitro
vi: Trong ống nghiệm

source: In vitro antibacterial efficiency of a mixture of ciprofloxacin, metronidazole and minocycline (3Mix), with and without the addition of rifampicin (100 µg each/ml) (4Mix), against oral bacteria of children was assessed by Sato et al.
vi: Hiệu quả kháng khuẩn in vitro của hỗn hợp ciprofloxacin, metronidazole and minocycline (3Mix), có và không có thêm rifampicin (100 µg mỗi/ml) (4Mix), chống lại vi khuẩn vùng miệng của trẻ em được đánh giá bởi Sato và cộng sự.

source: In vitro/In situ
vi: Trong ống nghiệm/Tại chỗ

source: In vivo
vi: Trong cơ thể

source: InTroduCTIon
vi: Giới thiệu

source: Inaccurate plating or pipetting.
vi: Cấy hoặc dùng pipet không chính xác.

source: Inactive-small lacuna with a smooth border
vi: Không hoạt động - lỗ nhỏ với đường viền mịn

source: Include three control wells of medium alone to provide the blanks for absorbance readings.
vi: Gồm 3 giếng chứng chỉ có môi trường để cung cấp ô trống cho việc đọc chỉ số hấp thụ.

source: Increase cell density at plating.
vi: Tăng mật độ tế bào nuôi cấy.

source: Increase incubation time with Detergent Reagent or incubate at 37°C.
vi: Tăng thời gian ủ với Detergent Reagent hoặc ủ ở 37°C.

source: Increase incubation time with MTT Re- agent until purple color is evident inside cells when viewed under microscope.
vi: Tăng thời gian ủ với MTT đến khi màu tím thấy rõ ràng trong tế bào khi nhìn dưới kính hiển vi.

source: Increase time in culture after plating for cell recovery.
vi: Tăng thời gian nuôi cấy để phục hồi tế bào.

source: Increased apoptosis
vi: Tăng chết tế bào theo lập trình

source: Increased collagen phagocytosis
vi: Tăng thực bào collagen

source: Increased inflammatory response
vi: Tăng phản ứng viêm

source: Increased production of matrix
vi: Tăng sản phẩm của matrix

source: Increased root length.
vi: Tăng chiều dài chân răng.

source: Increased width of root walls (this is generally observed before apparent increase in root length and often occurs 12-24 months after treatment).
vi: Tăng chiều rộng của thành chân răng (điều này là thường thấy trước khi tăng rõ ràng chiều dài chân răng và thường xảy ra 12-24 tháng sau điều trị).

source: Incubate for 2 to 4 hours until purple precipitate is visible.
vi: Ủ 2 đến 4 giờ đến khi tủa màu tím nhìn thấy được.

source: Incubate for 6 to 24 hours.
vi: Ủ trong 6 đến 24 giờ.

source: Incubate plate in the dark.
vi: Ủ đĩa nuôi cấy trong buồng tối.

source: Incubate the cells under conditions appropriate for the cell line for 6 to 48 hours (to recover from handling).
vi: Ủ tế bào dưới điều kiện thích hợp cho mỗi dòng tế bào từ 6 đến 48 giờ (để khôi phục lại khi xử lý)

source: Incubation time for reduction of MTT is too short.
vi: Thời gian ủ cho sự giảm của MTT quá ngắn.

source: Incubation time for solubilization of formazan dye too short (intact cells with intracellular dye visible when viewed under the microscope).
vi: Thời gian ủ cho sự hoà tan của nhuộm formazan quá ngắn (tế bào nguyên với thuốc nhuộm trong tế bào nhìn thấy khi nhìn dưới kính hiển vi).

source: Inflammation
vi: Viêm

source: Inflammation in your bones, tissues, or muscles can result in external swelling.
vi: Viên trong xương, mô mềm, hoặc cơ có thể dẫn đến sưng bên ngoài.

source: Informed Consent
vi: Sự Đồng Thuận

source: Inhibits collagenases and matrix metalloproteinase and is not cytotoxic.
vi: Ức chế collagenases và matrix metalloproteinase và không độc tính tế bào.

source: Initiation of formation
vi: Bắt đầu hình thành

source: Insect bites, illnesses, or injuries often result in external swelling.
vi: Côn trùng cắn, bị ốm, hoặc bị chấn thương thường gây sưng bên ngoài.

source: Inside of your body, swelling is often the result of organ inflammation, fluid retention, or flatulence.
vi: Bên trong cơ thể, sưng thường là kết quả của viêm các cơ quan, giữ nước hoặc đầy hơi.

source: Intact
vi: Nguyên vẹn

source: Integration with the adjacent bone
vi: Tích hợp với xương kế cận

source: Interestingly, 0.39 mg/mL 3Mix, which had a less cytotoxic effect on cultured cells, significantly reduced isolated bacteria compared with the control group.
vi: Thật thú vị, 0.39 mg/mL 3Mix, có ít độc tính tế bào trong nuôi cấy tế bào, giảm ý nghĩa vi khuẩn được phân lập, so sánh với nhóm chứng.

source: Interestingly, Ca(OH)(2) was conducive with SCAP survival at all concentrations.
vi: Nhưng Ca(OH)(2) tạo thuận lợi cho SCAP tồn tại tại mọi nồng độ.

source: Interestingly, maternal use of some probiotic strains seems to influence the composition of breast milk.
vi: Thật thú vị, việc sử dụng một số chủng probiotic ảnh hưởng đến thành phần sữa mẹ.

source: Interestingly, probiotics are also suggested to increase the lifetime of voice prosthesis by inhibiting the adhesion of unwanted microbes.
vi: Thật thú vị, các probiotic cũng được đề xuất để làm tăng tuổi thọ bằng cách ức chế sự kết dính của các vi khuẩn không mong muốn.

source: Internal swelling is often a side effect of medication or the result of a serious injury.
vi: Sưng bên trong thường là tác dụng phụ của thuốc hoặc kết quả của chấn thương nghiêm trọng.

source: Intracanal medicament
vi: Đặt thuốc trong ống tuỷ

source: Introduction
vi: Giới thiệu

source: Introduction .
vi: Giới thiệu .

source: Introduction to Cell Culture
vi: Giới thiệu nuôi cấy tế bào

source: Introduction to Cell Culture .
vi: Giới thiệu nuôi cấy tế bào.

source: Introduction: A 3-antibiotic combination (3Mix) is widely used in endodontics for root canal disinfection, particularly in pulp revascularization procedures.
vi: Giới thiệu: 3 kháng sinh phối hợp (3Mix) được sử dụng rộng rãi trong nội cho khử trùng ống tuỷ, đặc biệt là trong phương pháp tái sinh mạch máu tuỷ răng.

source: Introduction: The aim of this study was to assess the cell viability and messenger RNA expression of inter- leukin (IL)-1a and IL-6 in 3T3 fibroblast cells when in
vi: Giới thiệu: mục đích của nghiên cứu này là để đánh giá khả năng di động và biểu hiện của messenger RNA của interleukin (IL)-1a và IL-6 trong tế bào nguyên bào sợi 3T3 khi

source: Irrigation
vi: Bơm rửa

source: Isolated stem cells of dental origin are able to form pulp-like tissue with deposition of tubular dentin, if they are transplanted into a suitable carrier system.
vi: Phân lập tế bào gốc của răng có thể hình thành mô dạng tuỷ răng với sự lắng đọng ống ngà, nếu chúng được cấy vào một hệ thống chuyên chở thích hợp.

source: It acts through the inhibition of DNA gyrase.
vi: Nó hoạt động thông qua sự ức chế DNA gyrase.

source: It belongs to fluoroquinolone group.
vi: Nó thuộc nhóm thuốc fluoroquinolone.

source: It binds to the DNA, disrupts the helical structure and lead to rapid cell death [9].
vi: Nó liên kết với ADN, phá vỡ các cấu trúc xoắn, và dẫn đến tế bào chết nhanh chóng [9].

source: It can result in formation of tissue far from their original position [13].
vi: Nó có thể dẫn đến hình thành của mô xa từ vị trí ban đầu của chúng [13].

source: It exhibits very potent activity against gram negative bacteria but very limited activity against gram positive bacteria [9].
vi: Nó thể hiện hoạt động chống lại vi khuẩn gram âm nhưng chống vi khuẩn gram dương rất hạn chế [9]

source: It has been proven that blood after evoked bleeding from apical papilla contains a 700-fold higher concentration of stem cells than the peripheral blood [16].
vi: Người ta đã được chứng minh rằng máu sau khi làm chảy máu từ nhú chóp chứa một nồng độ tế bào gốc cao gấp 700 lần máu ngoại biên [16].

source: It has been suggested that osteocytes playa role in degradation of the bone matrix surrounding them in the process of osteocytic osteolysis (Belanger 1969).
vi: Người ta cho rằng tạo cốt bào đóng vai trò trong sự thoái hoá của khung xương xung quanh chúng trong quá trình osteocytic osteolysis (Belanger 1969).

source: It has to be mentioned that there is a lack of randomized control studies or cohort studies and the success rate is mostly based on case series or case studies.
vi: Cần phải nói rằng còn thiếu các nghiên cứu ngẫu nhiên có nhóm chứng hoặc nghiên cứu đoàn hệ và tỉ lệ thành công chủ yếu dựa trên nghiên cứu ca hoặc loạt ca.

source: It is a nitroimidazole compound.
vi: Là một hợp chất của nitroimidazole.

source: It is claimed to have a setting time of 12 minutes, which is considerably shorter than other calcium silicate cements such as mineral trioxide aggregate (MTA) (2, 3), and according to the manufacturer, it has better mechanical and handling properties (4).
vi: Nó được khẳng định là có thời gian đông cứng là 12 phút, đó là ngắn hơn đáng kể các loại xi măng calcium silicate khác như MTA (2, 3), và theo nhà sản xuất, nó đặc tính cơ học và thao tác tốt hơn (4).

source: It is connected with the fact that the main source of these growth factors, are platelets.
vi: Nó được kết nối với thực tế là các nguồn chính của các yếu tố tăng trưởng, là tiểu cầu.

source: It is important to find
vi: Điều quan trọng là phải tìm

source: It is often due to fluid retention or an allergic reaction.
vi: Nó thường do giữ nước hoặc dị ứng.
